# ExternalCommandsData Properties

---
The ExternalCommandsData type exposes the following members.
| Name| Description
---|---|---
| AssemblyName|  The assembly path of the menu item.
| AvailabilityClassName|  The full class name for the class providing the entry point to decide availability of this menu item.
| ClassName|  The name of the class containing the implementation for the command.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ExternalCommandsData Class
Autodesk.Revit.UI Namespace